Revit 2027 API
SpecTypeId.SurfaceAreaPerUnitLength Property
 Surface Area per Unit Length, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SurfaceAreaPerUnitLength { get; }
Public Shared ReadOnly Property SurfaceAreaPerUnitLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SurfaceAreaPerUnitLength {
	ForgeTypeId^ get ();
}
static member SurfaceAreaPerUnitLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace